#include <iostream>

using namespace std;

int main()
{
	int a,b,c,k=0,N,i1,i2,i3,a1,b1,c1;
	cin >> a >> b >> c >> N;
	a1=(N-(N%a))/a;														//Упрощаем цикл, находим макс кол-во каждого элемента 
	b1=(N-(N%b))/b;
	c1=(N-(N%c))/c;
	for(int i1=0; i1<=a1; i1++)											//Проверяем каждый вариант от a
		for(int i2=0; i2<=b1; i2++)
			for(int i3=0; i3<=c1; i3++)
			{
			if((a*i1+b*i2+c*i3)!=0)										// 0 0 0 не интересует
				if(N%(a*i1+b*i2+c*i3)==0 && N/(a*i1+b*i2+c*i3)==1)		//1. Проверяем делимость, хотя достаточно и 2. т.е. совпадение рез-та 
					k=k+1;												//считаем К
			}
	cout << k << endl;	
	
	for(int i1=0; i1<=a1; i1++)											//Выводим каждый вариант тем же циклом
		for(int i2=0; i2<=b1; i2++)
			for(int i3=0; i3<=c1; i3++)
			{
			if((a*i1+b*i2+c*i3)!=0)										//соотв
				if(N%(a*i1+b*i2+c*i3)==0 && N/(a*i1+b*i2+c*i3)==1)		//соотв
				{
					cout << i1 << " " << i2 << " " << i3 << " " << endl;
				}
			}
}
